<?php

$filters = [
    "bdate" => "/^[0-9]{4}-[0-9]{2}-[0-9]{2}$/",
    "event" => "/^([0-1]?[0-9]|2[0-3]):[0-5][0-9]$/",
    "artist" => "/^[1-4]$/",
    "description" => "/^[-a-zA-Z0-9\s.',àâçéèêëîïôûùüÿñæœ]{3,2000}$/",
    "promo" => "/^[-a-zA-Z0-9\sàâçéèêëîïôûùüÿñæœ]{3,30}$/",
    "venue_name" => "/^[-a-zA-Z0-9\s.',àâçéèêëîïôûùüÿñæœ]{3,50}$/",
    "venue_address_1" => "/^[-a-zA-Z0-9\s.',àâçéèêëîïôûùüÿñæœ]{3,50}$/",
    "venue_address_2" => "/^[-a-zA-Z0-9\s.',àâçéèêëîïôûùüÿñæœ]{3,50}$/",
    "city" => "/^[-a-zA-Z\sàâçéèêëîïôûùüÿñæœ]{3,50}$/",
    "region" => "/^[-a-zA-Z\sàâçéèêëîïôûùüÿñæœ]{3,50}$/",
    "postal" => "/^[0-9]{2,6}$/",
    "country" => "/^[1-5]$/",
    "capacity" => "/^[0-9]{1,6}$/",
    "attendance" => "/^[0-9]{1,6}$/",
    "performance" => "/\b(1|2)\b/",
    "time" => "/^[0-9]{1,4}$/",
    "contact_firstname" => "/^[-a-zA-Z\s'àâçéèêëîïôûùüÿñæœ]{3,50}$/",
    "contact_lastname" => "/^[-a-zA-Z\s'àâçéèêëîïôûùüÿñæœ]{3,50}$/",
    "email" => "/^[\w\-\.]+@([\w-]+\.)+[\w-]{2,}$/",
    "number" => "/^[+][0-9]{11}$/",
    "recorded" => "/\b(yes|no)\b/",
    "submit" => "/submit/",
];

$files_ext = [
    "png" => "image/png",
    "pdf" => "application/pdf",
    "jpeg" => "image/jpeg",
];